module.exports = {
    AddType: "刷新",
    Duration: "刷新",
    Actions: {
        1: {
            行为: "设置临时值",
            变量: "flag1003",
            值: 1,
        },
        2: {
            行为: "设置临时值",
            变量: "flag1003",
            值: 0,
        },
        3: {
            行为: "结束状态",
        },
        4: {
            行为: "选择目标",
            目标: "自己",
        },
        5: {
            行为: "对白",
            i18n: "cursedie",
        },
        6: {
            行为: "自杀",
        },
    },
    Attr: {},
    Events: {
        激活状态: [{
            行为: 1,
        }],
        用主技后: [{
            行为: [2, 3],
        }],
        状态结束: [{
            行为: [4, 5, 6],
            条件: [1, 2],
        }],
    },
    Conds: {
        1: {
            判断: ["flag1003", ">", 0],
        },
        2: {
            判断(dOption) {
                return !dOption.force; // 直接删除的话不触发效果
            },
        },
    },
};